{
  "mods": [
    {
      "id": "2819870318",
      "name": "Hide LCD Controls (Mod)",
      "author": "bcmpinc",
      "tooltip": "Adds button to show/hide LCD controls in terminal",
      "description": "Do you like using programmable blocks, do you like them displaying information on their monitor, but don't like the clutter it gives in the control panel? This mod hides the LCD configuration controls and adds yet another control that allows you to make them visible again. The control to show/hide LCD controls is added to every block that has configurable LCDs. ",
      "updated": 1659017500
    },
    {
      "id": "2426611028",
      "name": "Accelerometer",
      "author": "Natomic",
      "tooltip": "Adds an accelerometer to the HUD",
      "updated": 1647055853
    },
    {
      "id": "2784598126",
      "name": "AIM-9 Seek and Lock Tone Sound Mod",
      "author": "Const",
      "description": "A quick mod to replace the vanilla locking/lock acquisition tone to that of the AIM-9's, and a bleep from F-14 RWR tones for unlocking.",
      "updated": 1661730604
    },
    {
      "id": "2137637584",
      "name": "(ARMCO) Starwars Rendering (Mod)",
      "author": "Kreeg",
      "tooltip": "Provides Renderer Modifications, to enhance Visuals for the game.",
      "description": "This mod is designed to allow the Project to enhance visuals and create that Starwars Space Environment, while also improving interaction visuals.",
      "hidden": "false",
      "updated": 1666123813
    },
    {
      "id": "1878844801",
      "name": "AutoRun",
      "author": "Klime",
      "tooltip": "Automatic running.",
      "description": "Press Q to start running. Press any movement key (W A S D) or Q to stop.\n\nRunning speed can be varied with the scroll wheel.\nThe 3 speeds are: 10m/s (sprint), 6m/s (run), 2m/s (walk)\n\n/autorun rebind\nAllows the autorun key to be changed. Supports single keys only (e.g R, X, etc)\n  ",
      "updated": 1681077254
    },
    {
      "id": "2581520240",
      "name": "Better Spotlights",
      "author": "Thorn Blackwell",
      "tooltip": "This mod makes a number of improvements on spotlights, based on what exists in reality.",
      "description": "The hazy cone effect is removed, and the light produced is cast farther than vanilla spotlights. In reality, the cone of light haze is an effect only seen in dense atmospheres, and its appearance is also a sign of why the light is limited in range. Most of the environments a space engineer will find themselves in won't do either. In space, or on the Moon, Mars, or Europa, there is little or no atmosphere to scatter or limit light. So, on half of the planets/moons, and all of space in this game there is no reason to simulate that which would not exist.\nThe lines in the light cast have been removed, because experiments with light show that they would not be visible beyond a few feet in front of the spotlight. In order for a shadow to be cast by objects in front of the light, much more of the light must be obscured. The glass guard that is supposed to create the lines doesn't block the central point of the light source in any significant way, and is therefore invisible at a distance from the spotlight itself.\n  ",
      "updated": 1644634300
    },
    {
      "id": "1475392343",
      "name": "Build Colors",
      "author": "Sisk",
      "tooltip": "This mod allows you to create customized color sets for building, which can then be easily imported into another world.",
      "updated": 1681956529
    },
    {
      "id": "514062285",
      "name": "Build Info",
      "author": "Digi",
      "tooltip": "Displays more information about the block you're holding or aiming at, along with lots of other features. *Requires Text HUD API!*",
      "updated": 1640273450
    },
    {
      "id": "2392775805",
      "name": "Build Info (bleeding edge)",
      "author": "Digi",
      "tooltip": "A more frequently updated version of BuildInfo mod. Please use this one if you want to help find and report issues. *Requires Text HUD API!*",
      "updated": 1684548647
    },
    {
      "id": "540223802",
      "name": "Caldari Skybox",
      "author": "Stone Cold Jane Austen",
      "updated": 1644634300
    },
    {
      "id": "2923698329",
      "name": "Camera - Over The Shoulder",
      "author": "Adriano",
      "tooltip": "Adds another camera option to Space Engineers.",
      "description": "Over-the-shoulder is a camera view point that is featured in most modern third-person shooters and action games.",
      "updated": 1678651676
    },
    {
      "id": "806331071",
      "name": "Camera Panning",
      "author": "Digi",
      "tooltip": "Enables players to change the direction of the camera while viewing it.",
      "description": "This mod enables players to change the direction of the camera while viewing it. Works for any camera block, modded or vanilla.",
      "updated": 1644685634
    },
    {
      "id": "801185519",
      "name": "Colorful Icons",
      "author": "typekcz",
      "tooltip": "Adds color to the ingame icons.",
      "updated": 1637463044
    },
    {
      "id": "2198451962",
      "name": "Colorful Rendering (Mod)",
      "author": "Ryukki",
      "tooltip": "This plugin will make the game rendering more colorful like other games.",
      "description": "Ever felt like SE visuals were a little bland? Or that putting pee shine on Earthlike isn't a visual upgrade for the game? With this mod which uses Medieval Engineers superior visuals as base now has more vibrant colors along with shadows.",
      "hidden": "false",
      "updated": 1666123813
    },
    {
      "id": "2538074869",
      "name": "Deep Space 4K - Weather fix",
      "author": "Habibu",
      "tooltip": "High Resolution Realistic Skybox!",
      "updated": 1659017396
    },
    {
      "id": "2077166496",
      "name": "Easy Block Renaming",
      "author": "Meridius_IX / Lucas",
      "tooltip": "Adds controls to nearly all block types that allows you to easily rename multiple blocks at once.",
      "description": "Adds controls to nearly all block types that allows you to easily rename multiple blocks at once.\n- Multiple Block Renaming: Simply select all the blocks you want to rename, enter the new name they should receive in the \"New Naming\" field, and then press the \"Replace Name\" button.\n- Prefix and Suffix Names: The prefix and suffix options allow you to add the text in the \"New Naming\" field to the existing block names. \"Prefix Name\" will add the text to the beginning of the block name, while \"Suffix Name\" will add the text to the end of the block name.\n- Reset Name: The \"Reset Name\" button will reset the name of selected blocks back to their default names (the name they receive when you initially build the block). Please note it does not suffix the block with numbers. This can be useful if some degenerate NPC drone decides to hack your terminal control menu and scramble all the names of your blocks. I'm sure there are other uses for it as well ;)\n  ",
      "updated": 1643429477
    },
    {
      "id": "1805199276",
      "name": "Easy Control Button Access",
      "author": "Meridius_IX / Lucas",
      "description": "Ever find yourself in a combat situation and scrambling in the terminal to take control of either a Remote Control or Turret? The goal of this mod is to make that scramble a little less stressful. This mod takes the Control button for the Remote Control and Turret blocks and moves it to the top of the terminal. No more scrolling!\n\nThis mod may have been inspired by my own frustrations with the vanilla button placement",
      "updated": 1643429790
    },
    {
      "id": "2821462932",
      "name": "Easy Programmable Block Buttons",
      "author": "pyro000 / Lord Pyro",
      "description": "Moves the Edit and Recompile Buttons to the Top, recommended if you are develoving an InGameScript with MDK or whatever editor you are using.\n  \nCode copied and based on Easy Control Button Access by Meridius_IX / Lucas.",
      "updated": 1659017500
    },
    {
      "id": "2950011596",
      "name": "Flight Vector",
      "author": "BDCarrillo",
      "description": "\nWhen seated in a cockpit, this mod draws aids to depict the prograde, retrograde, and gravity vector for your current grid. Note these lines are a fixed length, and only indicate direction.\n\nB(lue)ow, R(ed)everse, G(reen)ravity\n\nRuns client-side only.\n\nYou can cycle the line overlays by typing \"/vector lines\" or \"/vector symbols\" in chat.  Defaults and color configurations are available, please see the mod page for details https://steamcommunity.com/sharedfiles/filedetails/?id=2950011596\n\nCredits\n-DirectedEnergy for the idea\n-Jerrai for the clever mnemonic\n",
      "updated": 1679806230
    },
    {
      "id": "2958267813",
      "name": "GPS Extended (Mod)",
      "author": "VengantMjolnir",
      "tooltip": "Allows adding a GPS point at a distance from the player.",
      "description": "This is a simple mod designed to do one thing, add a GPS marker at a specified distance. Use it with /xgps 'distance' 'name'. Distance is in Kilometres and the name can be whatever you want. An example: /xgps 2.5 An Asteroid I want to visit",
      "hidden": "false",
      "updated": 1680928466
    },
    {
      "id": "2765229451",
      "name": "GPS Helper",
      "author": "Kaito",
      "tooltip": "GPS Helper is a set of chat commands that make management of your GPS points easier.",
      "description": "\nBased on GPSHelper by CrazyDave137, seemingly abandoned and non-functional. I picked it up, cleaned it a bit, and fixed issues with string filtering. Commands are the same, I just fixed some internals and minor performance issuese that nobody would have noticed anyway.\n\nCode available on GitHub[github.com].\n\nUsage\n\n[string] denotes an optional parameter. You may provide it, or leave it blank.\n\nWhen adding a GPS, it will be used as the base name. Omitting will use the Player name instead.\n\nWhen filtering, providing an argument will try to do a substring match ('contains') on the GPS name, description, and hexadecimal string representation of the colour.\n\n/gpsx [string] creates a GPS point at current location, noting the local planet in the description. An auto-incrementing hexadecimal auto-ID string is appended to uniquely identify each GPS.\n/gpsx_reset resets the auto-incrementing auto-ID. Does not modify existing GPS.\n/gps_export [string] export all matching GPS to clipboard. No argument exports all GPS.\n/gps_toggle [string] toggle visibility of all matching GPS. No argument toggles all GPS.\n/gps_off [string] turn visibility of matching GPS off. No argument toggles all GPS.\n/gps_on [string] turn visibility of matching GPS on. No argument toggles all GPS.\n/gps_remove [string] remove all matching GPS. No argument removes all GPS. WARNING: Can not be undone!\n\nProps\n\nCrazyDave137 for authoring the original mod\nDigi for putting up with my endless flood of questions and being an all round nice chap\n  ",
      "updated": 1659017500
    },
    {
      "id": "2979392197",
      "name": "Hide Platform Icons",
      "author": "avaness",
      "tooltip": "Hides the PC, Xbox, and Playstation icons",
      "description": "This mod will hide the platform icons by making them invisible and zero width",
      "hidden": "false",
      "updated": 1684786708
    },
    {
      "id": "1469072169",
      "name": "HUD Compass",
      "author": "Zelious",
      "tooltip": "Adds a compass to the HUD. *Requires Text HUD API!*",
      "updated": 1640273457
    },
    {
      "id": "911144486",
      "name": "HudLcd",
      "author": "Jawastew",
      "tooltip": "Display your LCD text on your HUD!",
      "updated": 1644634300
    },
    {
      "id": "2626059962",
      "name": "HUD - Modern and Fancy",
      "author": "Adriano",
      "tooltip": "A modern and fancy new HUD designed for easy use.",
      "updated": 1642376923
    },
    {
      "id": "2626756831",
      "name": "HUD - Modern and Fancy (Color)",
      "author": "Adriano",
      "tooltip": "A modern and fancy new HUD designed for easy use.",
      "updated": 1642376964
    },
    {
      "id": "2766681016",
      "name": "Star Wars Imperial Lock On Sound (Mod)",
      "author": "Jay und Drang",
      "tooltip": "This mod will make the lock on sound a imperial lock on sound effect.",
      "description": "Basic mod to change the vanilla lock on sound effects to that of a TIE Fighter as seen in Episode IV. Start up sound, followed by looped search effect, then faster search noise and tone when lock is established.",
      "hidden": "false",
      "updated": 1666123813
    },
    {
      "id": "2871017418",
      "name": "Improved Rendering",
      "author": "???",
      "description": "A mod used to improve rendering. This item includes, improved post-processing, cool sun flares, less-saturated overall image, dark and blue skybox and a bright blue star.",
      "updated": 1678651676
    },
    {
      "id": "2940288034",
      "name": "Korean Font for RichHudMaster",
      "author": "Arstraea",
      "tooltip": "Add korean font to Rich Hud Master, specially for Build Vision.",
      "description": "= 설정 방법 =\n\nF2를 눌러 Rich Hud Master 의 설정창인 Rich HUD Terminal을 엽니다.\n\n열린 설정창의 왼쪽 Mod List:에서 Build Vision을 선택합니다.\n\nSettings -> GUI Settings 항목 안에서 Font 부분을 찾습니다.\n\nLoad Fonts 버튼을 누르고 위쪽의 드롭다운 [V] 를 눌러 koKR_NanumBarunGothic을 선택합니다.\n  ",
      "hidden": "true",
      "updated": 1678651676
    },
    {
      "id": "2409196107",
      "name": "Korean Font for TextHudAPI",
      "author": "Arstraea",
      "tooltip": "Add korean font to TextHudAPI, specially for Build Info.",
      "description": "= 설정 방법 =\n  \n기본적으론 빌드인포에서 사용하는 텍스트들 중 한글 부분이 정상적으로 나올 겁니다.\n그러나 툴바(행동단축바) 쪽에서는 ???? 등으로 나올 수 있습니다.\n\n채팅창을 열고 F2를 누르면 화면 좌측 상단에 Mod Settings라는 텍스트가 뜰 겁니다.\n이걸 마우스로 눌러 Build Info -> Toolbar 로 갑니다.\n\n열린 설정창을 밑으로 내려 Action Status Font Override를 찾아 클릭하여 Off 로 바꾸면 정상 표시됩니다.\n  ",
      "hidden": "true",
      "updated": 1678651676
    },
    {
      "id": "1169829560",
      "name": "Less Drill Dust and Stone Particles",
      "author": "Nikolas March",
      "tooltip": "Reduces the number of particles that are used for drills in game.",
      "updated": 1659017396
    },
    {
      "id": "670717906",
      "name": "Milky Way Skybox",
      "author": "Darth Biomech",
      "tooltip": "Milky Way skybox, based on true photos of space.",
      "updated": 1642367250
    },
    {
      "id": "670718659",
      "name": "Milky Way Skybox (insane resolution)",
      "author": "Darth Biomech",
      "tooltip": "Milky Way skybox, based on true photos of space.",
      "updated": 1642367255
    },
    {
      "id": "2903639290",
      "name": "More Thruster Actions",
      "author": "StarCpt",
      "description": "Adds 2 toolbar actions to thrusters:\n\nMax Thrust override - sets override to 100%\nReset Thrust override - sets override to 0%",
      "updated": 1678651676
    },
    {
      "id": "2497985921",
      "name": "Projector Extra (Mod)",
      "author": "Viktor",
      "tooltip": "Convenience features for the projector block: Intuitive manual alignment and loading a self-repair projection.",
      "description": "Allows intuitive alignment of loaded projections using the usual movement and rotation keys. \n  \nAdds button to load a self-repair projection of the projector's own grid. \n\nCompatible with the Multigrid Projector, but it does not require the plugin. \n\nWorks with online multiplayer games without the need for a server plugin. \n\nFor support join the SE Mods Discord: https://discord.gg/PYPFPGf3Ca\n  ",
      "hidden": "false",
      "updated": 1684548668
    },
    {
      "id": "1171575610",
      "name": "Particle Performance Optimization Pack",
      "author": "Nikolas March",
      "tooltip": "Reduces the number of particles in game.",
      "updated": 1659017396
    },
    {
      "id": "1289485324",
      "name": "Projections To Assembler",
      "author": "Meridius_IX / Lucas",
      "tooltip": "This mod adds a button to the projector block that will queue the needed components for the currently projected grid in your assembler.",
      "description": "This mod adds a button to the projector block that will queue the needed components for the currently projected grid in your assembler.\nHow To Use:\nEnsure your Projector Block and Assembler Blocks are Enabled / Turned On\nAssembler cannot be set to 'Disassemble'. It can optionally be set to 'Cooperative Mode'.\nLoad your grid into the Projector Block.\nAt the bottom of the Projector Block options, select the assembler you want to use from the Listbox.\nAt the bottom of the Projector Block options, press the button labled 'Send To Assembler'.\nCheck your Assembler queue. The projection components should now be loaded!\nAdd Missing Parts From Inventory:\nIf you do not want to add the full queue of components to the assembler queue, you can press the 'Send Missing Parts' button to add just the parts you do not already have in inventory.\n\nKnown issue: You will not be able to use button panels, scripts, or timers to assemble parts for a projection on servers.",
      "updated": 1643433502
    },
    {
      "id": "2947081810",
      "name": "Projector Highlighter",
      "author": "BDCarrillo",
      "tooltip": "Projector Highlighter adds color-coded wireframe around projected blocks showing their state for clearer visual feedback",
      "description": "Ever had trouble finding that one projected block that didn't get placed? I introduce to you the Projector Highlighter!\n\nProjected blocks that can be built have a green wireframe around their block space, while incorrect blocks will have a red outline (without \"Show Only Buildable\" selected), both of which are visible through other blocks.\n\nYellow blocks are damaged or incomplete blocks connected to parts of the projection.\n\nFor simplicity, this runs only on clients and they bear the brunt of a slightly inefficient grid check. Only grids within 250m are checked every minute to see if they have any projectors.\n\nCycle the highlights by entering /highlight in chat\n\nExpect it to take up to a minute when placing a new projector to see any effect.\nOnce it's picked up on a projector updates occur every second.",
      "updated": 1679627873
    },
    {
      "id": "2900046920",
      "name": "Projector Profiles",
      "author": "StarCpt",
      "description": "This mod adds a couple buttons and stuff to easily save and load projector profiles",
      "updated": 1678651676
    },
    {
      "id": "2766681393",
      "name": "Star Wars Rebel Lock On Sound (Mod)",
      "author": "Jay und Drang",
      "tooltip": "This mod will make the lock on sound a Rebel lock on sound effect.",
      "description": "Basic mod to change the vanilla lock on sound effects to that of an X-Wing Fighter as seen in Episode IV. Start up sound, followed by looped search effect, then faster search noise and tone when lock is established.",
      "hidden": "false",
      "updated": 1666123813
    },
    {
      "id": "1289657379",
      "name": "Screen Gunk Be Gone!",
      "author": "Whiplash141",
      "tooltip": "This mod reduces screen gunk by toning down most of the post-processing effects.",
      "description": "Since Keen does not like giving us graphical options, I decided to make a mod to remove the crap that is smeared all over the screen. I have also reduced vignette and the chromatic abomination aberration. I think that the bloom looks real neat on the tracers, so I've kept it (but had to tone it down b/c it was blinding after removing the dirt).\n\nEnjoy being able to see a bit better!",
      "updated": 1678651676
    },
    {
      "id": "2907163289",
      "name": "Silent Suit",
      "author": "Walto",
      "tooltip": "Silence, finally !",
      "description": "Removes all suit voice warning\n\nThis mod keeps the suit voice silent.\n\n\n\n\nYou can find my source code here : https://github.com/WalTho/SilentSuit/tree/main/SilentSuit\n  ",
      "updated": 1678651676
    },
    {
      "id": "2788241343",
      "name": "Snarky Sounds",
      "author": "w4stedspace ",
      "tooltip": "This mod is for people who are tired of the default suit voice, and perhaps life also...",
      "description": "This mod is for people who are tired of the default suit voice, and perhaps life also...\n\nPlease be aware, this suit AI does NOT care for your well being - quite the opposite. While still providing all HUD voice notifications (and with FAR more variants) this mod is more about reminding you that you should already be paying attention ;)\n\nI'd intended this for April Fools, but hey... I'm sure in some multiverse someplace it's still on time.\n\nThe video is a demo of a few lines only, there are MANY more.\n\nReplaces the following Suit and Game Audio notifications:\n\n- All Suit and Ship Power Notifications\n- Hydrogen Notifications\n- Health Notifications\n- Handbrake and Antenna Notifications\n- Inventory Notifications\n- More planned...\n\nThere are MANY variations (91 currently) ;)\n\nThis mod was made live on Twitch with the help of the wonderful SE community, you can join us here: https://www.twitch.tv/w4stedspace",
      "updated": 1659017396
    },
    {
      "id": "1662953858",
      "name": "Sneaky Sounds - Quieter Tools",
      "author": "Splitsie",
      "tooltip": "This is for those people who like hearing battle sounds loud while not being deafened by their grinder, welder and most of all drill.",
      "description": "This mod reduces the volume of hand tools, ship tools, weather, doors, placement sounds and a few others that often feel deafening, while leaving the explosions booming, gatlings cracking and letting you hear a little bit more of the atmospheric sounds (though not the deafening rain).\nFor everyone who loves a good action movie, but doesn't feel that mining is action, this one's for you!\n  ",
      "updated": 1644246099
    },
    {
      "id": "1136188499",
      "name": "Space Just Got Real",
      "author": "Dr. Novikov",
      "tooltip": "A more realistic skybox",
      "updated": 1637507904
    },
    {
      "id": "2950431210",
      "name": "Status Report",
      "author": "BDCarrillo",
      "description": "Ever wanted a concise report of things happening on your ship? Well with simple chat inputs you can inundate yourself in data!\n\n/report\nShows a list of commands in the chat box\n\n/report inventory\nDisplays all components, ores, ingots, and ammo on board\n\n/report damage\nShows damaged functional (not armor) blocks\n\n/report twr\nDisplays thrust-to-weight ratio and max lift capability for hydrogen thrusters\n\n/report cargo\nDisplays cargo capacity and fill level of your ship\n\n/report power\nDisplays a count and status of functional power producing blocks\n\nRuns client-side only.\nPlease see the mod page for details/updates/feedback https://steamcommunity.com/sharedfiles/filedetails/?id=2950431210\n\n",
      "updated": 1679806230
    },
    {
      "id": "758597413",
      "name": "Text HUD API",
      "author": "Draygo",
      "tooltip": "Required by some mods.",
      "updated": 1637502610
    },
    {
      "id": "2360788836",
      "name": "Welder Eyestrain Reduction",
      "author": "Vox Serico",
      "tooltip": "This mod reduces the intense flickering of the light produced by the welding tool.",
      "description": "This mod reduces the intense flickering of the light produced by the welding tool.\nThe brightness and other effects remain the same, but the strobe-like flashing has been toned down significantly.\n\nYou don't need to be extra photosensitive to feel discomfort from welding for any period of time. Even Xocliw has expressed this to be annoyance over six years ago - and it's still a problem!\n",
      "updated": 1659017396
    },
    {
      "id": "704012607",
      "name": "Whip's Camera Overlay",
      "author": "Whiplash141",
      "tooltip": "A modification for the default camera overlay.",
      "description": "This is my camera overlay. It has been redesigned from the ground up to be unobtrusive yet helpful for long range weapon targeting. It is cleaner than the crappy default overlay.\nTransparency of the cross lines looks different in-game due to the nature of .dds image compression. They may appear very prominent at times but they will not obstruct the view of objects behind them too badly.",
      "updated": 1644685634
    },
    {
      "id": "2098118471",
      "name": "Whip's Turret Overlay",
      "author": "Whiplash141",
      "tooltip": "This is a turret version of my Camera Overlay mod.",
      "description": "This will apply the overlay to ANY turret in the game without any additional work. That includes turrets added by other mods.\nThis will NOT work with some weapon core turrets because many of them are not actually turrets and do not inherit the turret API. As such, I can't use the turret API to modify their overlay.",
      "updated": 1659017396
    }
  ]
}